FROM python:3.9-alpine3.16

RUN mkdir -p /core/
# создание директории в контейнере

COPY requirments.txt /core/requirments.txt
# копирование файла в контейнер в директорию задаю ему такое же имя

RUN pip install --no-cache-dir -r /core/requirments.txt
# устанавливаю все зависимости в контейнере, необходимые для проекта
# т.к не перемещаю вирт. среду с зависимостями (нет смысла, контейнер и так изолирован)
# то нужно зависимости подключать вручную
# pip по умолчанию есть в базовом image python

COPY quiz /core/quiz/
# копирую весь проект в контейнер, без venv, idea dockerfile и тз

WORKDIR core/quiz/
# определяю рабочую директорию, чтобы команды (cmd, entrypoint) запускались из неё, без указания
# полного пути, т.е указываю проект quiz в качестве рабочей директории
# (внешний quiz, содержащий все приложения), чтобы можно было просто прописать manage.py

EXPOSE 8000
# Декларирую использование порта

CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]